package com.study.javamodel.arithmetic;

/**
 * @className
 * @Description TODO
 * @Author 付林虎
 * @Date 2021/3/3 8:31
 * @Version V1.0
 */
public class Arithmetic2 {
    /**
     老师设计了几个课题分别分配给若干小组进行研究学习。考虑到部分学生可能对其他课题感兴趣，老师给每位同学一次机会递交调整申请：
     老师请每位同学将自己的请求以 [x,y] 的形式写在列表中，表示自己初始在小组 x，希望调整到小组 y（若x与y相等，表示学生请求留在原先的小组）。
     老师将所有学生的请求按照学号顺序排列，收集在列表 requests 中，即列表中每个元素的下标对应了学生的学号。 为了使调整前后每个组人数不变，调整小组是以交换的形式进行，
     在同一列表内记录一次成功交换的情况（说明：若交换的次序是为 0->2->1->0，则记作 [0,2,1]）。

     最后，若不能满足全部学生的请求，则返回空数组 []；否则，请将最终的小组交换情况整理成二维数组并返回（注意小组交换情况可能有多种，可返回任意一种）。

     示例 1：

     输入：requests = [[1,2],[2,1],[0,2],[2,3],[3,0]]
     输出：?
     **/
    public static void main(String[] args) {
        int[][] requests= {{1,2},{2,1},{0,2},{2,3},{3,0}};


    }


}
