package com.study.javamodel.arithmetic;

/**
 * @className
 * @Description TODO
 * @Author 付林虎
 * @Date 2021/3/3 8:31
 * @Version V1.0
 */
public class Arithmetic3 {
    /**
     某实习生在我司实习期间，有 3 件关键事情要做：
     1.        参加一个在线连载算法课程的学习：实习生通常在有课程未学习完成时就要学习，并规划每天学习 k 个章节。
               其更新情况以 [更新日,更新章节数] 的形式存在二维数组 update 中。
               若当天剩余可学章节不满 k 个，当天任务仅为学习剩余章节，不刷题。
     2.        有时实习生需要回学校写论文：
               写论文期间无法继续学习在线课程。
               其返校的起止时间以 [返校起始时间,返校结束时间] 的形式记录在二维数组 out 中，用例数据保证out数组中无区间重合。
     3.        刷题练习：实习生既不需要在校改论文，也无新的章节可学之时，就会在家自己刷题练习；刷题练习无需等到课程更新后开始。
     该实习生想估算下，在算法课程最后一次更新之前，自己可以进行刷题练习的日期有哪些。请以列表形式按日期大小升序返回。
     **/
    public static void main(String[] args) {
        //设 一共有n个章节
        //设  一共更新 m天
        //

    }


}
